Product_Backlog.org
* Report
** DONE Vision & Business case
   CLOSED: [2012-11-21 Wed 13:00]
   - Introduction
   - Problem statement
   - Summary of system features
** DONE Use cases
   CLOSED: [2012-12-16 Sun 01:34]
*** DONE Use cases (text)
    CLOSED: [2012-12-16 Sun 01:34]
**** DONE UC1: Create new document
     CLOSED: [2012-11-21 Wed 13:00]
**** DONE UC2: Edit document
     CLOSED: [2012-11-21 Wed 13:00]
**** DONE UC3: Delete document
     CLOSED: [2012-11-22 Thu 11:45]
**** DONE UC4: Merging documents (resolve conflict)
     CLOSED: [2012-12-16 Sun 01:21]
**** DONE UC5: Offline sync
     CLOSED: [2012-11-22 Thu 11:45]
**** DONE UC6: New folder
     CLOSED: [2012-11-22 Thu 12:47]
**** DONE UC7: New project
     CLOSED: [2012-11-22 Thu 13:05]
**** DONE UC8: Find old version of document
     CLOSED: [2012-12-16 Sun 01:33]
**** DONE UC9: Share Document
     CLOSED: [2012-12-16 Sun 01:26]
**** DONE UC10: Log in
     CLOSED: [2012-12-16 Sun 01:27]
*** DONE Use Case Model (UML)
    CLOSED: [2012-11-22 Thu 12:47]
** DONE Supplementary specification (FURPS+)
   CLOSED: [2012-12-17 Mon 03:09]
   - [ ] Functionality
   - [ ] Usability
   - [ ] Reliability
   - [ ] Performance
   - [ ] Supportability
** DONE Glossary
   CLOSED: [2012-11-21 Wed 13:01]
** DONE System sequence diagram
   CLOSED: [2012-11-22 Thu 12:05]

** DONE Domain Model
   CLOSED: [2012-11-21 Wed 13:29]

** DONE Logical architecture
   CLOSED: [2012-11-21 Wed 13:58]

** DONE Operation contract
   CLOSED: [2012-11-22 Thu 12:47]
** DONE Interaction Diagram
   CLOSED: [2012-12-17 Mon 03:09]
*** DONE Communication Diagram
    CLOSED: [2012-11-27 Tue 11:30]
*** DONE Sequence Diagram
    CLOSED: [2012-12-17 Mon 03:09]
** DONE Software Attributes / Qualities
   CLOSED: [2012-12-17 Mon 08:28]
** DONE Package Diagram
   CLOSED: [2012-11-23 Fri 15:16]
** DONE Class diagram
   CLOSED: [2012-11-23 Fri 15:17]
** DONE SAD
   CLOSED: [2012-12-17 Mon 08:28]
** DONE N+1
   CLOSED: [2012-12-17 Mon 08:28]
** DONE ER-Diagram
   CLOSED: [2012-12-12 Wed 18:17]
** DONE Document GRASP
   CLOSED: [2012-12-17 Mon 08:28]
** DONE HTML Format
   CLOSED: [2012-12-12 Wed 18:17]
* C#
** DONE C# Basic architecture
   CLOSED: [2012-11-22 Thu 14:11]
** DONE System
   CLOSED: [2012-11-27 Tue 11:56]
*** DONE Define central methods.
    CLOSED: [2012-12-13 Thu 10:17]
    - Method signature
    - Document
** DONE Client
   CLOSED: [2012-12-12 Wed 18:18]
** DONE Database
   CLOSED: [2012-12-16 Sun 01:42]
   - [X] ER-Diagram
   - [X] User table
   - [X] Document table
   - [X] User-Document table
** DONE System architecture
   CLOSED: [2012-12-17 Mon 03:10]
   - [X] Implement GRASP
   - [X] Create/Edit/Delete Document
   - [X] Create/Edit/Delete Folder
   - [X] Database Connection
   - [X] GUI Client
** DONE Test
   CLOSED: [2012-12-17 Mon 08:28]
   - TEST EVERYTHING!!
** DONE User Directory
   CLOSED: [2012-12-16 Sun 01:42]
   - [X] Personal Root directory
** DONE User Authentication
   CLOSED: [2012-12-17 Mon 03:10]
   - [X] Username and password relationship

   - [X] Storage of username and password
   - [X] Fetch and compare
** DONE Sharing documents / folders
   CLOSED: [2012-12-16 Sun 01:42]
   - [X] Server code

   - [X] Share with permissions (view/edit/delete)
   - [X] Permisions DB: Add permisions to userdocument
** DONE Offline synchronization
   CLOSED: [2012-12-17 Mon 03:11]
   - [X] Client to server connection
   - [X] Server handling new data
   - [X] Client accepts all

   - [X] Server handling new data (Where permission meets requirements) (ice cold overwrite)

   - [X] Server simple comparision of document history

   - [X] Server merge of documents
