Product_Backlog.tex
% Created 2012-12-17 Mon 08:28
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Product$_{\mathrm{Backlog}}$}
\author{Bergar Simonsen}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.11}}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
\section{Report}
\label{sec-1}
\subsection{\textbf{DONE} Vision \& Business case}
\label{sec-1-1}

   \texttt{CLOSED:} \textit{2012-11-21 Wed 13:00}

\begin{itemize}
\item Introduction
\item Problem statement
\item Summary of system features
\end{itemize}
\subsection{\textbf{DONE} Use cases}
\label{sec-1-2}

   \texttt{CLOSED:} \textit{2012-12-16 Sun 01:34}
\subsubsection{\textbf{DONE} Use cases (text)}
\label{sec-1-2-1}

    \texttt{CLOSED:} \textit{2012-12-16 Sun 01:34}
\begin{itemize}

\item \textbf{DONE} UC1: Create new document\\
\label{sec-1-2-1-1}%
\texttt{CLOSED:} \textit{2012-11-21 Wed 13:00}


\item \textbf{DONE} UC2: Edit document\\
\label{sec-1-2-1-2}%
\texttt{CLOSED:} \textit{2012-11-21 Wed 13:00}


\item \textbf{DONE} UC3: Delete document\\
\label{sec-1-2-1-3}%
\texttt{CLOSED:} \textit{2012-11-22 Thu 11:45}


\item \textbf{DONE} UC4: Merging documents (resolve conflict)\\
\label{sec-1-2-1-4}%
\texttt{CLOSED:} \textit{2012-12-16 Sun 01:21}


\item \textbf{DONE} UC5: Offline sync\\
\label{sec-1-2-1-5}%
\texttt{CLOSED:} \textit{2012-11-22 Thu 11:45}


\item \textbf{DONE} UC6: New folder\\
\label{sec-1-2-1-6}%
\texttt{CLOSED:} \textit{2012-11-22 Thu 12:47}


\item \textbf{DONE} UC7: New project\\
\label{sec-1-2-1-7}%
\texttt{CLOSED:} \textit{2012-11-22 Thu 13:05}


\item \textbf{DONE} UC8: Find old version of document\\
\label{sec-1-2-1-8}%
\texttt{CLOSED:} \textit{2012-12-16 Sun 01:33}


\item \textbf{DONE} UC9: Share Document\\
\label{sec-1-2-1-9}%
\texttt{CLOSED:} \textit{2012-12-16 Sun 01:26}


\item \textbf{DONE} UC10: Log in\\
\label{sec-1-2-1-10}%
\texttt{CLOSED:} \textit{2012-12-16 Sun 01:27}

\end{itemize} % ends low level
\subsubsection{\textbf{DONE} Use Case Model (UML)}
\label{sec-1-2-2}

    \texttt{CLOSED:} \textit{2012-11-22 Thu 12:47}
\subsection{\textbf{DONE} Supplementary specification (FURPS+)}
\label{sec-1-3}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 03:09}

\begin{itemize}
\item $\Box$ Functionality
\item $\Box$ Usability
\item $\Box$ Reliability
\item $\Box$ Performance
\item $\Box$ Supportability
\end{itemize}
\subsection{\textbf{DONE} Glossary}
\label{sec-1-4}

   \texttt{CLOSED:} \textit{2012-11-21 Wed 13:01}
\subsection{\textbf{DONE} System sequence diagram}
\label{sec-1-5}

   \texttt{CLOSED:} \textit{2012-11-22 Thu 12:05}
\subsection{\textbf{DONE} Domain Model}
\label{sec-1-6}

   \texttt{CLOSED:} \textit{2012-11-21 Wed 13:29}
\subsection{\textbf{DONE} Logical architecture}
\label{sec-1-7}

   \texttt{CLOSED:} \textit{2012-11-21 Wed 13:58}
\subsection{\textbf{DONE} Operation contract}
\label{sec-1-8}

   \texttt{CLOSED:} \textit{2012-11-22 Thu 12:47}
\subsection{\textbf{DONE} Interaction Diagram}
\label{sec-1-9}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 03:09}
\subsubsection{\textbf{DONE} Communication Diagram}
\label{sec-1-9-1}

    \texttt{CLOSED:} \textit{2012-11-27 Tue 11:30}
\subsubsection{\textbf{DONE} Sequence Diagram}
\label{sec-1-9-2}

    \texttt{CLOSED:} \textit{2012-12-17 Mon 03:09}
\subsection{\textbf{DONE} Software Attributes / Qualities}
\label{sec-1-10}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 08:28}
\subsection{\textbf{DONE} Package Diagram}
\label{sec-1-11}

   \texttt{CLOSED:} \textit{2012-11-23 Fri 15:16}
\subsection{\textbf{DONE} Class diagram}
\label{sec-1-12}

   \texttt{CLOSED:} \textit{2012-11-23 Fri 15:17}
\subsection{\textbf{DONE} SAD}
\label{sec-1-13}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 08:28}
\subsection{\textbf{DONE} N+1}
\label{sec-1-14}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 08:28}
\subsection{\textbf{DONE} ER-Diagram}
\label{sec-1-15}

   \texttt{CLOSED:} \textit{2012-12-12 Wed 18:17}
\subsection{\textbf{DONE} Document GRASP}
\label{sec-1-16}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 08:28}
\subsection{\textbf{DONE} HTML Format}
\label{sec-1-17}

   \texttt{CLOSED:} \textit{2012-12-12 Wed 18:17}
\section{C\#}
\label{sec-2}
\subsection{\textbf{DONE} C\# Basic architecture}
\label{sec-2-1}

   \texttt{CLOSED:} \textit{2012-11-22 Thu 14:11}
\subsection{\textbf{DONE} System}
\label{sec-2-2}

   \texttt{CLOSED:} \textit{2012-11-27 Tue 11:56}
\subsubsection{\textbf{DONE} Define central methods.}
\label{sec-2-2-1}

    \texttt{CLOSED:} \textit{2012-12-13 Thu 10:17}

\begin{itemize}
\item Method signature
\item Document
\end{itemize}
\subsection{\textbf{DONE} Client}
\label{sec-2-3}

   \texttt{CLOSED:} \textit{2012-12-12 Wed 18:18}
\subsection{\textbf{DONE} Database}
\label{sec-2-4}

   \texttt{CLOSED:} \textit{2012-12-16 Sun 01:42}

\begin{itemize}
\item $\boxtimes$ ER-Diagram
\item $\boxtimes$ User table
\item $\boxtimes$ Document table
\item $\boxtimes$ User-Document table
\end{itemize}
\subsection{\textbf{DONE} System architecture}
\label{sec-2-5}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 03:10}

\begin{itemize}
\item $\boxtimes$ Implement GRASP
\item $\boxtimes$ Create/Edit/Delete Document
\item $\boxtimes$ Create/Edit/Delete Folder
\item $\boxtimes$ Database Connection
\item $\boxtimes$ GUI Client
\end{itemize}
\subsection{\textbf{DONE} Test}
\label{sec-2-6}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 08:28}

\begin{itemize}
\item TEST EVERYTHING!!
\end{itemize}
\subsection{\textbf{DONE} User Directory}
\label{sec-2-7}

   \texttt{CLOSED:} \textit{2012-12-16 Sun 01:42}

\begin{itemize}
\item $\boxtimes$ Personal Root directory
\end{itemize}
\subsection{\textbf{DONE} User Authentication}
\label{sec-2-8}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 03:10}

\begin{itemize}
\item $\boxtimes$ Username and password relationship
\item $\boxtimes$ Storage of username and password
\item $\boxtimes$ Fetch and compare
\end{itemize}
\subsection{\textbf{DONE} Sharing documents / folders}
\label{sec-2-9}

   \texttt{CLOSED:} \textit{2012-12-16 Sun 01:42}

\begin{itemize}
\item $\boxtimes$ Server code
\item $\boxtimes$ Share with permissions (view/edit/delete)
\item $\boxtimes$ Permisions DB: Add permisions to userdocument
\end{itemize}
\subsection{\textbf{DONE} Offline synchronization}
\label{sec-2-10}

   \texttt{CLOSED:} \textit{2012-12-17 Mon 03:11}

\begin{itemize}
\item $\boxtimes$ Client to server connection
\item $\boxtimes$ Server handling new data
\item $\boxtimes$ Client accepts all
\item $\boxtimes$ Server handling new data (Where permission meets requirements) (ice cold overwrite)
\item $\boxtimes$ Server simple comparision of document history
\item $\boxtimes$ Server merge of documents
\end{itemize}

\end{document}
